/*
	题目：
		创建一个java文件，起名 123.java可以吗？
			可以，完全可以，在windows操作系统中文件名叫做：123.java没毛病。
		123其实并不是标识符。只是一个文件名。
		只不过在123.java文件中无法定义public的类。
	
	标识符除了命名规则之外，还有命名规范：
		1、命名规则和命名规范有什么区别？
			命名规则是语法，不遵守就会编译报错。
			命名规范只是说，大家尽量按照统一的规范来进行命名，不符合规范也行，
			代码是可以编译通过的，但是你的代码风格和大家不一样，这个通常也是
			不允许的。

			规则类似于：现实世界中的法律。
			规范类似于：现实世界中的道德。

			统一按照规范进行的话，代码的可读性很好。
			代码很容易让其它开发人员理解。

		2、具体的命名规范是哪些？

			规范1：见名知意（这个标识符在起名的时候，最好一看这个单词就知道啥意思。）

			规范2：遵循驼峰命名方式，什么是驼峰（一高一低，一高一低...）
				驼峰有利于单词与单词之间很好的进行分隔
				BiaoShiFuTest，这个很好，一眼就能看出来是4个单词。

			规范3：类名、接口名有特殊要求
				类名和接口名首字母大写，后面每个单词首字母大写。
					StudentTest、UserTest ，这是类名、接口名。

			规范4：变量名、方法名有特殊要求
				变量名和方法名首字母小写，后面每个单词首字母大写。
					nianLing（NianLing这样就不符合了。）
					mingZi（MingZi这样也不符合了。）
			
			规范5：所有“常量”名：全部大写，并且单词和单词之间采用下划线衔接。
				USER_AGE ：用户年龄
				MATH_PI：固定不变的常量3.1415926.....
*/
public class IdentifierTest{
	public static void main(String[] args){
		// 以下代码看不懂没关系，别着急。
		// 主要看两个汉语拼音，可读性很强。
		// nianLing和mingZi都是黑色字体的标识符。
		int nianLing = 20;
		String mingZi = "zhangsan";
	}
}
