
/*
	1、在java中任何有效的代码必须写到“类体”当中，最外层必须是一个类的定义。

	2、public表示公开的，class表示定义一个类，Test是一个类名。类名后面必须是
	一对大括号，这一对大括号被称为“类体”

	3、大括号必须是成对的。并且建议都要成对编写，这样才不会丢掉。
		{}
		[]
		()

	4、什么时候代码缩进？
		我包着你，你就比我低一级。你就需要缩进。
		没有合理的缩进，代码可读性很差。
		或者也可以这样所，大括号里的都需要缩进。
		缩进就是可读性问题，不缩进也不影响程序的编译和执行。
		
*/

public class Test{ // 声明/定义一个公开的类，起个名字叫Test


	// 类体


	// 整个这一块的代码被称为：main方法（程序的入口，SUN公司java语言规定的）
	// 也就是说：JVM在执行程序的时候，会主动去找这样一个方法。没有这个规格的方法，程序是无法执行的。
	// main方法也可以叫做主方法。
	// 注意：方法必须放到“类体”中，不能放到“类体”外面。
	// 任何一个程序都要有一个入口，没有入口进不来，无法执行。
	public static void main(String[] args){ //这是一个入口方法。
		
		// 方法体
		// 注意：方法体由一行一行的“java语句”构成
		// 并且非常重要的是：任何一条java语句必须以“;”结尾，并且这个分号还得是英文的，不能用中文分号。
		// ";" 代表一条语句的结束。
		// 非常非常重要的是：方法体中的代码遵循自上而下的顺序依次逐行执行。

		System.out.println("Test1");

		// System.out.println();这行代码的作用是向控制台输出一句话。就是这个作用。
		// 注意：如果println后面小括号里的内容是一个“字符串”的话，必须使用英文双引号括起来。
		// 双引号也要成对儿写。
		System.out.println("Test2");
	}

	
	// 能再来一个一模一样的入口吗？
	// 不行，有语法错误
	/*
	public static void main(String[] args){
	
	}
	*/

	// 方法2
	// 现在不执行不代表以后不执行，以后我们可以学习其它语法让他执行。
	public static void main2(String[] args){
		System.out.println("hehe");
	}

	// 方法3

	// 方法4

}