/*
	九九乘法表

	1*1=1
	1*2=2 2*2=4
	1*3=3 2*3=6 3*3=9
	1*4=4 2*4=8 3*4=12 4*4=16
	....
	......
	1*9=9 2*9=18.............................9*9=81

	各位，请找一下以上九九乘法表的特点？？？？？
		第一个特点：共9行。
		第二个特点：第1行1个。第2行2个。第n行n个。
	
	最重要的是：不要慌，慢慢的把思路捋出来，再写代码。
*/
public class ForTest06{
	public static void main(String[] args){
		
		// 9行，循环9次。
		for(int i = 1; i <= 9; i++){ // 纵向循环
			//System.out.println(i); // i是行号（1~9）
			// 负责输出一行的。（内部for循环负责将一行上的全部输出。）
			for(int j = 1; j <= i; j++){ // i是行号
				System.out.print(j + "*" + i + "=" + i * j + " ");
			}
			// 换行
			System.out.println();
		}
	}
}